{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faF/Users/Marcus/Developer/udacity/sdcar/CarND-Behavourial-Cloning/cnn.py\u00da\b<lambda>\u007f\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "batch_input_shape": [null, 16, 32, 3], "function_type": "lambda", "output_shape": [16, 32, 3], "output_shape_type": "raw", "name": "lambda_1", "input_dtype": "float32", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "b_constraint": null, "border_mode": "same", "nb_row": 1, "nb_col": 1, "nb_filter": 3, "name": "convolution2d_1", "input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activation": "relu", "batch_input_shape": [null, 16, 32, 3], "subsample": [1, 1], "bias": true, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "border_mode": "valid", "nb_col": 3, "b_constraint": null, "name": "convolution2d_2", "nb_filter": 16, "init": "glorot_uniform", "W_regularizer": null, "bias": true, "activation": "relu", "trainable": true, "subsample": [1, 1], "nb_row": 3, "W_constraint": null, "b_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 64, "b_constraint": null, "name": "dense_1", "input_dim": 336, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 10, "b_constraint": null, "name": "dense_2", "input_dim": 64, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 1, "b_constraint": null, "name": "dense_3", "input_dim": 10, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "b_regularizer": null}}]}